{"Document Name": "CONFIDENTIALITY AGREEMENT", "Parties": "EnCana", "Agreement Date": "November 6, 2003", "Effective Date": "November 25, 2003", "Expiration Date": "Notwithstanding anything herein to the contrary other than paragraph 7 above, all of the obligations of the parties hereunder shall (if not sooner terminated) terminate on the second anniversary of the date hereof; provided, however, that no such termination shall relieve a party from liability for any breach by such party of the terms hereof that exists on the date of such termination.", "Governing Law": "The validity and interpretation of this letter agreement shall be governed by, and construed and enforced in accordance with, the laws of the State of Colorado without regard to conflicts-of-law rules or principles.", "Exclusivity": "Until the first anniversary of the date hereof, EnCana will not, nor will it permit any of its subsidiaries, directors, officers or employees to, directly or indirectly, solicit or hire the services, as employee, consultant or otherwise, of any employee of TBI or its subsidiaries with whom EnCana had contact in connection with its consideration of the Transaction or who became known to EnCana specifically in connection with its consideration of the Transaction, except that this provision shall not prohibit the hiring of any such employee (i) who responds to any public advertising for employment without any other direct or indirect solicitation or (ii) whose employment by TBI or its subsidiary has been terminated prior to the commencement of discussions with such employee.", "No-Solicit Of Customers": "Until the first anniversary of the date hereof, EnCana will not, nor will it permit any of its subsidiaries, directors, officers or employees to, directly or indirectly, solicit or hire the services, as employee, consultant or otherwise, of any employee of TBI or its subsidiaries with whom EnCana had contact in connection with its consideration of the Transaction or who became known to EnCana specifically in connection with its consideration of the Transaction, except that this provision shall not prohibit the hiring of any such employee (i) who responds to any public advertising for employment without any other direct or indirect solicitation or (ii) whose employment by TBI or its subsidiary has been terminated prior to the commencement of discussions with such employee.", "No-Solicit Of Employees": "Until the first anniversary of the date hereof, EnCana will not, nor will it permit any of its subsidiaries, directors, officers or employees to, directly or indirectly, solicit or hire the services, as employee, consultant or otherwise, of any employee of TBI or its subsidiaries with whom EnCana had contact in connection with its consideration of the Transaction or who became known to EnCana specifically in connection with its consideration of the Transaction, except that this provision shall not prohibit the hiring of any such employee (i) who responds to any public advertising for employment without any other direct or indirect solicitation or (ii) whose employment by TBI or its subsidiary has been terminated prior to the commencement of discussions with such employee.", "Rofr/Rofo/Rofn": "Each party acknowledges and agrees that each reserves the right, in its sole and absolute discretion, to reject any and all proposals and to terminate discussions and negotiations with the other at any time.", "Change Of Control": "provided, however, that this Section 5 shall terminate with respect to EnCana if a person or entity (other than EnCana or an affiliate of EnCana) acquires, enters an agreement to acquire, or publicly proposes to acquire, directly or indirectly, by merger or otherwise, more than 50% of the voting securities of TBI (i.e., those securities of TBI that are entitled to participate in the annual election of directors), or otherwise acquires, enters an agreement to acquire, or publicly proposes to acquire, the ability to control the management or policies of TBI.", "Post-Termination Services": "Notwithstanding the termination of any discussions or the return or destruction of the Evaluation Material, each party and its Representatives will continue to be bound by their obligations of confidentiality hereunder for a period of eighteen months from the date hereof.", "Cap On Liability": "EnCana agrees that money damages would not be a sufficient remedy for any breach of this letter agreement by EnCana or any of its Representatives and that TBI shall be entitled to seek equitable relief, including injunction and specific performance, as well as reimbursement for legal and other expenses as a remedy for any such breach."}